[
    {
        "jobTitle": "Junior Software Test Automation Engineer",
        "companyName": "EPAM Systems",
        "datesEmployment": "July 2022 - July 2023",
        "responsibilities" : [
            "Develop and maintain automated test scripts and frameworks for payment gateway services.",
            "Assist in planning and conducting regression testing to validate software changes.",
            "Collaborate with senior team members to design comprehensive test cases.",
            "Execute automated test suites and analyze test results.",
            "Support integration testing efforts with third-party systems.",
            "Maintain accurate documentation of test cases and results.",
            "Contribute to the continuous improvement of testing processes.",
            "Actively participate in team meetings and collaborate with cross-functional teams.",
            "Provide support in analyzing customer-reported issues and validating fixes.",
            "Take initiative in self-learning and skill development."
        ],
        "achievements": ["🔁 Successfully led the migration of NPCI services from OLTP to Acquirer Subsystem(AcqSubsystem), contributing to uninterrupted transaction services."," 🚀 Received Delivery Excellence Award for exceptional performance in project delivery."
    ],
        "skillsUtilized": ["Java", "Selenium", "Git", "BDD (Behavioral Driven Development)", "Cucumber", "PostgreSQL", "Rest Assured", "Linux", "Jenkins"],
        "projects": []
      },
      {
        "jobTitle": "Junior Software Engineer Intern",
        "companyName": "EPAM Systems",
        "datesEmployment": "Feb 2022 - June 2023",
        "responsibilities": ["Actively contribute to test automation by creating and enhancing page object models for internal websites using Selenium WebDriver.", "Collaborate with the team to participate in testing processes and gain hands-on experience in automated testing practices."],
        "achievements": ["🙌 Recognized with a PAT on Back Award for outstanding contributions during internship."],
        "skillsUtilized": ["Java", "Selenium", "Git", "DesignPatterns"],
        "projects": []
      }
]