[{
    "title": "AutoCAD to G-Code Converter",
    "authors": ["Venkata Suresh Yarava"],
    "journalConference": "2021 IEEE Pune Section International Conference (PuneCon)",
    "doi": "https://ieeexplore.ieee.org/document/9686541",
    "description": "Numeric Controls are common today for the automated control of machining tools. High speed computer is used as an interface to implement such controls. This study aims to generate a G-code, directly from a drawing, AutoCAD, file and upload the same as a compatible G-Code for the NC Machine. This paper details the approach (concepts) and describes various steps involved in implementation from data extraction to transformation of data to G-Code.",
    "keywords": ["Software algorithms", "Machining", "Generators" ,"Data Mining"],
    "youtubeUrl": "eLeIdSe5ofE"
  },
{
    "title": "IOT Based Renewable Energy Monitoring System",
    "authors": ["Venkata Suresh Yarava", "Hari Shankar Jain"],
    "journalConference": "Smart Systems and Green Energy Technologies",
    "doi": "https://doi.org/10.13052/rp-9788770229647",
    "description": "Our project endeavors to revolutionize the monitoring of renewable energy systems through the development of an IoT-enabled device. By automating data collection and analysis processes, our device alleviates the burden of manual measurements and calculations, providing users with real-time insights into crucial parameters such as voltage, current, and system-specific data. Utilizing advanced algorithms, it tracks various performance characteristics including power output, charge conditions, temperature, and irradiation, facilitating efficient energy production. With seamless integration with a user-friendly mobile application, users can effortlessly monitor and manage their systems, while Bluetooth connectivity enables easy data transfer and printing. By bridging renewable energy systems with IoT technology, our project aims to enhance efficiency and accessibility in the pursuit of a sustainable energy future.",
    "keywords": ["Renewable energy", "Internet of Things", "Monitoring", "Micro controller","photovoltaic device"],
    "youtubeUrl": ""
}]